nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC7/KW43B43ZC7.xml
        <register>
          <name>ble_reg_whitelist_status</name>
          <description>Whitelist Search Status</description>
          <addressOffset>0x2FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x30003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>hw_wl_lookup_result</name>
              <description>Result of latest hardware white list lookup, The values indicate if query is finished or ongoing; successful or unsuccessful., 0x0: lookup in progress, 0x1: entry was found in whitelist, 0x2: entry was not found in whitelist, 0x3: whitelist search not done for this packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>wl_hw_lock</name>
              <description>Lock bits for Hardware whitelist access, This bit allows software and hardware to access the EBRAM whitelist locations safely., 0x0: whitelist is not in use by hardware, 0x1: whitelist is in use by hardware</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>wl_fsm_state</name>
              <description>Whitelist search state machine status, This is the whitelist state machine; e.g. wl_fsm_state; current value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>hw_wl_lookup_position</name>
              <description>Position of last hardware whitelist lookup in EBRAM, For successful lookups; it is the offset where specified address is located in the whitelist. For unsuccessful lookups; this is the offset to be asserted. For example; if specified address is between offset 3 and 4; it reports 4 which is the offset software will insert for the specified address. If whitelist_length = 10; the entry position is 0 to 9; and if the specified address is bigger than the offset 9th entry; it will report 10. For the extreme case (whitelist_length = 255; and the specified address is bigger than the offset 254th entry); it reports 255.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sw_wl_lookup_result</name>
              <description>Result of latest software white list lookup, The values indicate if query is finished or ongoing; successful or unsuccessful., 0x0: lookup in progress, 0x1: entry was found in whitelist, 0x2: entry was not found in whitelist, 0x3: whitelist search not done for this software command</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sw_wl_lookup_position</name>
              <description>Position of last software whitelist lookup in EBRAM, For successful lookups; it is the offset where specified address is located in the whitelist. For unsuccessful lookups; this is the offset to be asserted. For example; if specified address is between offset 3 and 4; it reports 4 which is the offset software will insert for the specified address. If whitelist_length = 10; the entry position is 0 to 9; and if the specified address is bigger than the offset 9th entry; it will report 10. For the extreme case (whitelist_length = 255; and the specified address is bigger than the offset 254th entry); it reports 255.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_td_start_addr</name>
          <description>Tx Descriptor Start Address</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>td_start_address</name>
              <description>Tx Descriptor Start Address, The currently active TD (Tx Descriptor) is pointed by td_start_address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_td_status</name>
          <description>Tx Descriptor Status</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>td_busy</name>
              <description>TD busy, Status indicating the active TD is busy and being used by hardware. Asserted when fetching TD starts and de-asserted right after TD status writes back., 0x0: TD is idle, 0x1: TD is busy and being used by hardware</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_extn_ant_switch_fail</name>
              <description>Tx antenna switch status on packet extension, Status indicating the Tx antenna switch for the current transmitted extension has failed., 0x0: Tx antenna switch pattern is honored; antSwitchStatus was never de-asserted, during packet extension, 0x1: Tx antenna switch pattern is not honored</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_extn_abort</name>
              <description>Tx extension packet hardware abort status, Status indicating the Tx extension packet is aborted by hardware., 0x0: No abort condition happened during Tx extension, 0x1: hardware abort condition was detected during Tx extension</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_has_err</name>
              <description>Tx Has Error, Tx packet of using this TD experienced at least 1 of the following errors., 0x0: No error, 0x1: At least 1 of rif_abort_tx; tx_dmem_underflow_intr; tx_aes_underflow_intr and, tx_lock_fail_intr has been asserted during packet transmission</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_dma_err</name>
              <description>Tx Has DMA Error, Tx packet of using this TD experienced DMA error., 0x0: No error, 0x1: SoC DMA slave has replied with ERROR response during packet transmission</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_rl_lockfail_sts</name>
              <description>Tx Has RL lock fail, Status indicating Tx packet has lock fail because of register loader, 0x0: No error, 0x1: Tx_lock_fail_intr has been asserted during packet transmission</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rd_start_addr</name>
          <description>Rx Descriptor Start Address</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rd_start_address</name>
              <description>Rx Descriptor Start Address, The currently active RD (Rx Descriptor) is pointed by rd_start_address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rd_status</name>
          <description>Rx Descriptor Status</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rd_busy</name>
              <description>RD busy, Status indicating the active RD is busy and being used by hardware. Asserted when fetching RD starts and de-asserted right after RD status writes back., 0x0: RD is idle, 0x1: RD is busy and being used by hardware</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_extn_rcv</name>
              <description>Extension Packet Received, This bit is valid ONLY on received packets when CRC has passed., 0x0: regular Rx packet was received, 0x1: extension field packet was received</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_extn_ant_switch_fail</name>
              <description>Rx antenna switch status on packet extension, Status indicating the Rx antenna switch for the current receiving extension has failed., 0x0: Rx antenna switch pattern is honored; antSwitchStatus was never de-asserted, during packet extension, 0x1: Rx antenna switch pattern is not honored</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_extn_abort</name>
              <description>Rx extension packet hardware abort status, Status indicating the Rx extension packet is aborted by hardware., 0x0: no abort condition happened during Rx extension, 0x1: hardware abort condition was detected during Rx extension</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_has_err</name>
              <description>Rx Has Error, Rx packet of using this RD experienced at least 1 of the following errors., 0x0: No error, 0x1: At least 1 of rif_abort_rx; rx_dmem_overflow_intr; rx_aes_underflow_intr and, rx_lock_fail_intr has been asserted during packet reception</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_dma_err</name>
              <description>Rx Has DMA Error, Rx packet of using this RD experienced DMA error., 0x0: No error, 0x1: SoC DMA slave has replied with ERROR response during packet reception</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_rl_lockfail_sts</name>
              <description>Rx Has RL lock fail, Status indicating Rx packet has lock fail because of register loader, 0x0: No error, 0x1: Rx_lock_fail_intr has been asserted during packet transmission</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rd_alt_curr</name>
              <description>Current RD in use, This bit indicates which RD pointer is currently in use. When rd_alt is 0 this bit is always 0; when rd_alt = 1 this bit toggles for every RX to indicate the RD in use., 0x0: Normal RD is being used, 0x1: Alternate RD is being used</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_extn_length</name>
              <description>Rx Extension Length, Length of valid I/Q samples received. The value is in the unit of 8 usec time frame. BLE still sends this I/Q samples to memory for firmware and indicates the valid number of samples in this field even though Rx was aborted during the extension reception., This bit is valid ONLY when rx_extn_rcv bit is set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rssi_arb_ctrl</name>
          <description>BLE RSSI ARBITRATION CONTROL</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ble_arb_rssi_val</name>
              <description>Software programable RSSI value for RSSI based arbitration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rd_start_addr_alt</name>
          <description>Alternate Rx Descriptor Start Address</description>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rd_start_address_alt</name>
              <description>Alternate Rx Descriptor Start Address, The Alternate RD (Rx Descriptor) is pointed by rd_start_address_alt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rd_ctrl</name>
          <description>Rx Descriptor Control</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rd_alt</name>
              <description>Toggle mode for RD_START_ADDRESS, This bit indicates which RD_START_ADDRESS is to be used, 0x0: always use rd_start_address, 0x1: use Toggle mode where rd_start_address and rd_start_address_alt are used for, alternating RX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rd_alt_reset</name>
              <description>Reset bit, This bit is used to reset the alternating mode, 0x0: No reset, 0x1: reset; use the RD_START_ADDRESS for the next pkt irrespective of what was used, for the previous pkt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_clk_ctrl_sleep_ok_timer</name>
          <description>BLE sleep ok timer</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sleep_ok_timer</name>
              <description>sys_clk_sync_sleep_ok will deassert at timer expiration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>aslv_lat_opt_en</name>
              <description>ahb access 4mclk domain register adaptive mechanism control bit, This bit enables or disables the adaptive mechanism inside the BLE AHB slave that is intended to improve latencies towards 4MHz domain registers. To restart the mechanism; after changing the SYS clock frequency; program it to 0 and back to 1. No r/w delays are needed. It is not necessary to restart the mechanism when switching to higher SYS clock frequency., 0x0: Disable the adaptive mechanism., 0x1: Enable the adaptive mechanism by default</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_aes_cntrl</name>
          <description>AES Control</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_go_dyn</name>
              <description>Run AES Encryption (active high pulse)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_ccm_clk_req</name>
              <description>CCM/AES clock control, 0x0: disable clock for encryption, 0x1: request (enable) clock for encryption</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>secure_irk_decrypt_dyn</name>
              <description>Decrypt IRK using DKey (active high pulse), When this bit is set; BTU will descramble the IRKs using DKEY from local store. The scrambled Keys should be written in BLE_REG_AES_DIN\* registeres and the plain text IRKs will be saved in BLE_REG_AES_DOUT register. The BLE_REG_AES_KEY\* register are not used in this mode., This bit is self clearing and is cleared by HW when AES operation is done., Note: Since BTU's AES engine only supports encryption mode (as purposely chosen for CCM mode); it is agreed with MICRO team that technically the Sentinel will perform the AES decryption operation to generate the ESK while BTU will carry out the AES encryption operation to derive the plain text SK. So; at BTU side we do such: SK = AES-128 Encryp (ESK; DKey_SK) IRK = AES-128 Encryp(EIRK; DKey_IRK) At S200 side; they do such: ESK = AES-128 Decryp(SK; DKey_SK) EIRK = AES-128 Decryp(IRK; DKey_IRK) So; the functional process on BTU side is to decrypt to unwrap the SK or IRK; but the actual HW operation is encryption.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lock_sw_aes_regs</name>
              <description>Lock Software AES registers from write, 0x0: All 12 Software AES registers (BLE_REG_AES_KEY_0~3; BLE_REG_AES_DIN_0~3;, BLE_REG_AES_DOUT_0~3) can be written as normal., 0x1: All 12 Software AES registers are read-only. Software and hardware write to them, is disabled.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_aes_key_0</name>
          <description>Key 0 for Software AES encryption</description>
          <addressOffset>0x610</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_key</name>
              <description>AES Key ([31:0] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_aes_key_1</name>
          <description>Key 1 for Software AES encryption</description>
          <addressOffset>0x614</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_key</name>
              <description>AES Key ([63:32] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_aes_key_2</name>
          <description>Key 2 for Software AES encryption</description>
          <addressOffset>0x618</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_key</name>
              <description>AES Key ([95:64] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_aes_key_3</name>
          <description>Key 3 for Software AES encryption</description>
          <addressOffset>0x61C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_key</name>
              <description>AES Key ([127:96] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_aes_din_0</name>
          <description>Raw Data Input 0 for Software AES encryption</description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_din</name>
              <description>Raw Data Input for AES Encryption ([31:0] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
