nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC7/KW43B43ZC7.xml
        <register>
          <name>ble_reg_ant_switch_rx_map_0</name>
          <description>Rx Antenna Switch Map: Map 0</description>
          <addressOffset>0x934</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_rx_map_1</name>
          <description>Rx Antenna Switch Map: Map 1</description>
          <addressOffset>0x938</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_rx_map_2</name>
          <description>Rx Antenna Switch Map: Map 2</description>
          <addressOffset>0x93C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_rx_map_3</name>
          <description>Rx Antenna Switch Map: Map 3</description>
          <addressOffset>0x940</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_rx_map_4</name>
          <description>Rx Antenna Switch Map: Map 4</description>
          <addressOffset>0x944</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_rx_map_5</name>
          <description>Rx Antenna Switch Map: Map 5</description>
          <addressOffset>0x948</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_rx_map_6</name>
          <description>Rx Antenna Switch Map: Map 6</description>
          <addressOffset>0x94C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
