nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC7/KW43B43ZC7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>BTU2</name>
      <description>btu2</description>
      <alternatePeripheral>BLE2</alternatePeripheral>
      <groupName>BTU2</groupName>
      <baseAddress>0x40110000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFA8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>btu_rif_ctl0</name>
          <description>RIF Control 0</description>
          <addressOffset>0xC00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x200</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>brf_rd_data_turnaround</name>
              <description>BRF Read Data Turnaround, 0x0: BRF read data will be ready on the next clock cycle after address given, 0x1: BRF needs one more clock cycle between address and read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_agc_counter_readback_enable</name>
              <description>Enable BRF readback LNA; CBPF and ADC overflow counters after AGC freeze, 0x0: BRF only readback RSSI and noise floor values at RSSI, 0x1: BRF readback extra 3 bytes (LNA; CBPF and ADC overflow counters) after RSSI read</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>radio_type</name>
              <description>Radio Type, 0x0: Unknown, 0x1: Marvell Gen3 radio; dBus mode, 0x2: Marvell Gen4 radio; dBus mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>radio_mode</name>
              <description>Radio Mode Selection, 0x0: Marvell Radio Mode, 0x1: KW Radio; Sideband RIF interface, 0x2: Unused, 0x3: Unused</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_brf_rssi_addr</name>
          <description>RIF BRF RSSI Address</description>
          <addressOffset>0xC06</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2E8</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rssi_addr</name>
              <description>RSSI Address, Address of the RSSI register in the radio.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ctrl1</name>
          <description>RIF Control 1</description>
          <addressOffset>0xC0C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt_reg_rif_bt_4m_clk_ena</name>
              <description>RIF Clock Gate Enable Override, RIF Clock Gate Enable Override; if set to 1; clock gating for RIF clock is disabled = ungated clocks.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bd_spi_data_bidir</name>
              <description>Uni- or Bi-directional dBus Data Line Selection, 0x0: uni-directional, 0x1: bi-directional</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bd_rxtx_data_bidir</name>
              <description>Uni- or Bi-directional RxData and TxData Line Selection, 0x0: uni-directional, 0x1: bi-directional</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rssi_value</name>
              <description>RSSI Value, The latest received RSSI value from the radio. This can be used to get RSSI values before a link is setup; for example; for FCS. To get RSSI value for an existing link use the DIAG area in EBRAM.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_rxon</name>
          <description>RIF RXON</description>
          <addressOffset>0xC0E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rxon_fixed</name>
              <description>RxOn fixed or use programmable timing, 0x0: use start and stop timing parameters, 0x1: rxOn = RxOn_Start[6]</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rxon_stop</name>
              <description>Delay from Rx finished (rifRx low) to rxOn falling edge, - Resolution: 0.25 us.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_pllclken_on_delay</name>
          <description>RIF PLL Clock Enable</description>
          <addressOffset>0xC10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2001</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>brf_pll_clk_en_on_delay_qus</name>
              <description>Delay from wakeUp to turning of BRF's PLL clock, - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_pll_clk_early_en</name>
              <description>Activate brf_pll_clk_en earlier along with brf_pu, 0x0: Activate brf_pll_clk_en at normal delay, 0x1: Activate brf_pll_clk_en earlier along with brf_pu</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_pll_clk_en_nb</name>
              <description>Activate brf_pll_clk_en during NB/MB scan packets Enable, 0x0: keep off during NB/MB scan packets, 0x1: activate brf_pll_clk_en during NB/MB scan packets</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_pll_clk_en_fixed</name>
              <description>Use fixed value for brf_pll_clk_en, 0x0: on/off_delay registers control the timing, 0x1: brf_pll_clk_en is the fixed value of bit[0]</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_txon</name>
          <description>RIF Tx On</description>
          <addressOffset>0xC12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3300</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>txon_fixed</name>
              <description>TxOn fixed; or use programmable timing, 0x0: use start and stop timing parameters, 0x1: txOn = TxOn_Start[6]</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>txon_stop</name>
              <description>Delay from Tx finished (rifTx low) to txOn falling edge, - Resolution: 0.25 us.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_pllclken_off_delay</name>
          <description>RIF PLL Clock Enable Off Delay</description>
          <addressOffset>0xC14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1D</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>brf_pll_clk_en_off_delay</name>
              <description>Delay from final dBus access finishing to turning off BRF PLL clock, - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_freq</name>
          <description>RIF FREQ</description>
          <addressOffset>0xC16</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rxtx_freq</name>
              <description>Rx or Tx Slot Indication, 0x0: Tx slot, 0x1: Rx slot</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>freq</name>
              <description>Channel Hop Frequency Number</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_brf_tx_pu</name>
          <description>RIF BRF Power Up for TX, brf_pu is the sideband signal used to turn on the BRF's power control.</description>
          <addressOffset>0xC18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x227</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>brf_tx_pu_on_delay_qus</name>
              <description>brf_pu on delay, Delay from wakeUp to turning on brf_pu. Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_tx_pu_off_delay_qus</name>
              <description>brf_pu off delay, Delay from last dBus access to turning off brf_pu. Resolution: 0.25 us.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_tx_pu_fixed</name>
              <description>Set brf_pu to a fixed value., BRF power up value., 0x0: use programmable timers, 0x1: fixed; brf_pu = brf_tx_pu_on_delay_us[0]</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ctrl2</name>
          <description>RIF Control 2</description>
          <addressOffset>0xC1A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>tx_data_inv</name>
              <description>Invert Tx data, 0x0: normal operation, 0x1: transmit data inverted</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_data_inv</name>
              <description>Invert Rx data, 0x0: normal operation, 0x1: receive data inverted</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_tx_pulse</name>
          <description>RIF Tx Pulse</description>
          <addressOffset>0xC1C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x80E6</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>tx_pulse_delay</name>
              <description>Tx Pulse Delay, Delay between wakeUp and txData sync plulse for dBus radio types. Resolution 0.25 us. The following formula must be fulfilled: doTxPulse &lt; TxOn_Start + LinkDelay.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_pulse_en</name>
              <description>Enable TxData sync pulse, 0x0: TxData sync pulse deactivated and pulse not generated, 0x1: TxData sync pulse activated and pulse generated</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_dbus_tx_pwrctl</name>
          <description>RIF dBus Tx Power Control</description>
          <addressOffset>0xC1E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x801C</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_tx_pwr_ctrl_wr_delay</name>
              <description>Delay from the trigger to start Tx Power Control Write dBus, Delay from rif_tx_req to enable Tx power control dBus writes. Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_tx_pwr_ctrl_wr_enable</name>
              <description>Enable Automatic Tx Power Control Write on the dBus</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_dbus_rx_pwrctl</name>
          <description>RIF dBus Rx Power Control</description>
          <addressOffset>0xC20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x801A</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_rx_pwr_ctrl_wr_delay</name>
              <description>Delay from the trigger to start Rx Power Control Write dBus, Delay from rif_rx_req to enable Rx power control dBus writes. Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_rx_pwr_ctrl_wr_enable</name>
              <description>Enable Automatic Rx Power Control Write on dBus</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_brf_rxpwrctl_addr</name>
          <description>RIF BRF Rx Power Control Address</description>
          <addressOffset>0xC22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x9</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rx_pwr_ctrl_addr</name>
              <description>Radio Register Address for Rx Power Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_brf_fsyn_addr</name>
          <description>RIF BRF FSYN Address</description>
          <addressOffset>0xC24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x6</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>fsyn_addr</name>
              <description>Radio Register Start Address for Fsyn data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_brf_txpwrctl_addr</name>
          <description>RIF BRF Tx Power Control Address</description>
          <addressOffset>0xC26</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>tx_pwr_ctrl_addr</name>
              <description>Radio Register Address for Tx Power Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_btc_dbus_rssi</name>
          <description>BTC RIF dBus RSSI</description>
          <addressOffset>0xC28</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8002</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_rssi_delay</name>
              <description>Delay from RSSI trigger to start of RSSI read, Delay from the end of rif_rx_req to enable dBus RSSI read back., Resolution 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_rssi_enable</name>
              <description>Enable Automatic Reading of RSSI on the dBus, 0x0: disable automatic reading of RSSI, 0x1: enable automatic reading of RSSI</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_dbus_tx_fsyn</name>
          <description>RIF Tx dBus Fsyn</description>
          <addressOffset>0xC2A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8034</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_tx_fsyn_delay</name>
              <description>Tx dBus Fsyn Delay, Delay from start of new Tx slot (i.e.; rif_tx_req) to sending the fsync information on the dBus., Resolution 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_tx_fsyn_wr_enable</name>
              <description>Tx dBus Fsyn Enable, Enables Tx automatic sending of fsync information on the dBus., 0x0: disable automatic sending of fsync info, 0x1: enable automatic sending of fsync info</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_dbus_rx_fsyn</name>
          <description>RIF Rx dBus Fsyn</description>
          <addressOffset>0xC2C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8042</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_rx_fsyn_delay</name>
              <description>Rx dBus Hop Delay, Delay time after start of Rx new slot (i.e.; rif_rx_req) to sending the fsync information on the dBus., Resolution 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_rx_fsyn_wr_enable</name>
              <description>Rx dBus Fsyn Enable, Enable Rx automatic sending of fsync information on the dBus., 0x0: disable automatic sending of fsync info, 0x1: enable automatic sending of fsync info</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_dbus_rx_pkt_len</name>
          <description>RIF dBus Rx Packet Length</description>
          <addressOffset>0xC2E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xC000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_rx_cte_len_enable</name>
              <description>dBus Rx CTE Length Enable, Enable Automatic Sending Rx Packet CTE Length on the dBus., 0x0: disable automatic dbus sending Rx packet CTE length, 0x1: enable automatic dbus sending Rx packet CTE length</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_rx_pkt_len_enable</name>
              <description>dBus Rx Packet Length Enable, Enable Automatic Sending Rx Packet Payload Length (including payload header; data; and crc) on the dBus., 0x0: disable automatic dbus sending Rx packet payload length, 0x1: enable automatic dbus sending Rx packet payload length</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_pulse_rx_delay</name>
          <description>RIF BLE Pulse Rx Delay</description>
          <addressOffset>0xC30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x135</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_pulse_rx_delay</name>
              <description>BLE Pulse Rx Delay, Timing Variable from rif_rx_req to BLE Pulse on Rx. Only assert under BLE traffic; and must be less or equal to BTU_RIF_RXPAON[9:0] - 4., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
